# 1 - Base de Dados

Para aplicar a ciência de Dados ao Marketing, são necessários dados a respeito do público em questão.

A forma mais popular de armazenar e utilizar dados para a Ciência de Dados é o formato CSV (Comma Separated Values -  em português, Valores separados por vírgula)
Este tipo de arquivo é muito semelhante às planilhas do excel, exceto pelo fato que os valores de cada linha são separados porvírgula. 

Para conseguir ler, analizar e manipular estes arquivos CSV com o python, é necessária a utilização da biblioteca pandas

Para utilizar uma biblioteca no python é necessário que no código seja importada a determinada biblioteca e, para isto, usamos a seguinte sintaxe:
`import nome_da_biblioteca`

Ainda sobre a importação das bibliotecas, podemos dar um apelido às bibbliotecas importadas com o comando `as`, ficando a seguinte sintaxe:
`import nome_da_biblioteca as apelido_da_biblioteca`

Após importar uma biblioteca no código, sempre que desejar utilizar alguma função dela, é necessário que chame a biblioteca pelo nome (se não tiver definido um apelido) ou pelo determidado apelido

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\arthu\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\arthu\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\arthu\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\arthu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\arthu\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
# Importa a biblioteca pandas com o apelido de pd
import pandas as pd

#### Nossa base de dados é referente a dados coletados na última campanha de marketing de um determinado banco

In [35]:
# Leitura da base de dados

# Repare que chamamos o pandas por meio do pd
# em seguida utilizamos a função read_csv para especificar qual o arquivo desejamos que seja lido pelo pandas
df = pd.read_csv('banco.csv')

# 2 - Exploração da base de Dados

### 2.1 - Função head() - Visualização dos Dados

In [36]:
# Exibir os 5 primeiros registros da base de dados
df.head(2)

,idade,emprego,estado_civil,educacao,saldo_bancario,possui_casa,emprestimo,dia,mes,duracao,qtd_contato,deposito
0,NaN,admin.,married,secondary,2343,yes,no,5,may,1042,1,yes
1,56.0,admin.,married,secondary,45,no,no,5,may,1467,1,yes

In [12]:
# Por padrão, a função head() só exibe os 5 primeiros elementos da base de dados
# Se desejar exibir mais ou menos registros, basta determinar o valor dentro do parênteses

# Exibir os 10 primeiros registros da base de dados
df.head(10)

,idade,emprego,estado_civil,educacao,saldo_bancario,possui_casa,emprestimo,dia,mes,duracao,qtd_contato,deposito
0,59,admin.,married,secondary,2343,yes,no,5,may,1042,1,yes
1,56,admin.,married,secondary,45,no,no,5,may,1467,1,yes
2,41,technician,married,secondary,1270,yes,no,5,may,1389,1,yes
3,55,services,married,secondary,2476,yes,no,5,may,579,1,yes
4,54,admin.,married,tertiary,184,no,no,5,may,673,2,yes
5,42,management,single,tertiary,0,yes,yes,5,may,562,2,yes
6,56,management,married,tertiary,830,yes,yes,6,may,1201,1,yes
7,60,retired,divorced,secondary,545,yes,no,6,may,1030,1,yes
8,37,technician,married,secondary,1,yes,no,6,may,608,1,yes
9,28,services,single,secondary,5090,yes,no,6,may,1297,3,yes

### 2.2 - Função shape - Retornar o tamanho da base de dados 
Quantidade de linhas e de colunas

In [13]:
# Respectivamente retorna a quantidade de linhas e a quantidade de colunas da base de dados
df.shape

(11162, 12)

#### Repare que a função shape retorna dois valores em sequência, assim como em listas e strings, é possível selecionar estes falores com as suas posições

In [14]:
# Irá retornar somente a quantidade de linhas da Base de Dados
df.shape[0]

11162

In [15]:
# Irá retornar somente a quantidade de colunas da Base de Dados
df.shape[1]

12

### 2.2.1 - Função len() - Retorna a quantidade de linhas do dataframe

Usar a função len ou shape[0] não possui diferença.

In [16]:
# Irá retornar a quantidade de linhas da Base de Dados
len(df)

11162

### 2.3 - Função coluns - Retorna o nome de todas as volunas da Base de Dados

In [17]:
# Exibe todas as colunas da Base de Dados
df.columns

Index(['idade', 'emprego', 'estado_civil', 'educacao', 'saldo_bancario',
       'possui_casa', 'emprestimo', 'dia', 'mes', 'duracao', 'qtd_contato',
       'deposito'],
      dtype='object')

#### Repare que a função columns retorna os valores em sequência, assim como em listas e strings, é possível selecionar estes falores com as suas posições

In [18]:
# Exibe a primeira coluna da Base de Dados
df.columns[0]

'idade'

In [19]:
# Exibe a segunda coluna da Base de Dados
df.columns[1]

'emprego'

In [20]:
# Exibe a terceira coluna da Base de Dados
df.columns[2]

'estado_civil'

In [21]:
# Exibe a última coluna da Base de Dados
df.columns[-1]

'deposito'

### 2.4 - Função info() - Informa, para cada coluna, a quantidade de valores não nulos e o tipo de dados da coluna

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   idade           11162 non-null  int64
 1   emprego         11162 non-null  object
 2   estado_civil    11162 non-null  object
 3   educacao        11162 non-null  object
 4   saldo_bancario  11162 non-null  int64
 5   possui_casa     11162 non-null  object
 6   emprestimo      11162 non-null  object
 7   dia             11162 non-null  int64
 8   mes             11162 non-null  object
 9   duracao         11162 non-null  int64
 10  qtd_contato     11162 non-null  int64
 11  deposito        11162 non-null  object
dtypes: int64(5), object(7)
memory usage: 1.0+ MB

#### Para facilitar a verificação de dados ausentes na base de dados, podemos usar as funções isnull() e sum(), para somar todos os valores nulos de cada coluna

In [25]:
# Exibe a quantidade de valores nulos em cada coluna
df.isna().sum()

idade             0
emprego           0
estado_civil      0
educacao          0
saldo_bancario    0
possui_casa       0
emprestimo        0
dia               0
mes               0
duracao           0
qtd_contato       0
deposito          0
dtype: int64

### 2.5.1 - Função describe Exibe uma descrição de todas as colunas que possuem valores numéricos
a primeira análise é a quantidade de valores

a segunda a média dos valores

a terceira é o desvio padrão (não precisamos focar aqui)

a quarta informa o menor valor presente na coluna

a quinta informa que 25% do valores são iguais ou menor ao valor informado

a sexta informa que 50% do valores são iguais ou menor ao valor informado

a sétima informa que 75% do valores são iguais ou menor ao valor informado

a oitava informa o maior valor presente da coluna

In [26]:
df.describe()

              idade  saldo_bancario           dia       duracao   qtd_contato
count  11162.000000    11162.000000  11162.000000  11162.000000  11162.000000
mean      41.231948     1528.538524     15.658036    371.993818      2.508421
std       11.913369     3225.413326      8.420740    347.128386      2.722077
min       18.000000    -6847.000000      1.000000      2.000000      1.000000
25%       32.000000      122.000000      8.000000    138.000000      1.000000
50%       39.000000      550.000000     15.000000    255.000000      2.000000
75%       49.000000     1708.000000     22.000000    496.000000      3.000000
max       95.000000    81204.000000     31.000000   3881.000000     63.000000

### 2.5.2 - Função describe(include = 'O') Exibe uma descrição de todas as colunas que possuem valores textuais (object)
a primeira análise é a quantidade de valores

a segunda é quantos valores únicos existem na coluna 

a terceira é, dos valores únicos, qual que mais aparece na coluna

a quarta informa quantos registros existem com o valor que mais aparece (top)

In [27]:
df.describe(include='O')

,emprego,estado_civil,educacao,possui_casa,emprestimo,mes,deposito
count,11162,11162,11162,11162,11162,11162,11162
unique,12,3,4,2,2,12,2
top,management,married,secondary,no,no,may,no
freq,2566,6351,5476,5881,9702,2824,5873

In [28]:
df['emprego'].value_counts()

management       2566
blue-collar      1944
technician       1823
admin.           1334
services          923
retired           778
self-employed     405
student           360
unemployed        357
entrepreneur      328
housemaid         274
unknown            70
Name: emprego, dtype: int64

### Dica

Quando usamos o describe, a quantidade de linhas retornadas é fixa (8 linhas para as colunas numéricas e 4 para as textuais), mas a quantidade de colunas depende de quantas colunas nossa base de dados possuí.

Se a base de dados possuir muitas colunas, a vizualização pode ficar ruim. Para solucionar isto, podemos fazer a matriz transposta do resultado (Para quem não se lembra, matriz transposta é inverter as linhas e colunas de uma matriz).

No python existe um comando muito fácil para fazer a matriz transposta. `Basta acrescentar um ".T"` no final do que deseja realizar a matriz transposta

In [29]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
idade,11162.0,41.231948,11.913369,18.0,32.0,39.0,49.0,95.0
saldo_bancario,11162.0,1528.538524,3225.413326,-6847.0,122.0,550.0,1708.0,81204.0
dia,11162.0,15.658036,8.420740,1.0,8.0,15.0,22.0,31.0
duracao,11162.0,371.993818,347.128386,2.0,138.0,255.0,496.0,3881.0
qtd_contato,11162.0,2.508421,2.722077,1.0,1.0,2.0,3.0,63.0

In [30]:
df.describe(include='O').T

              count unique         top  freq
emprego       11162     12  management  2566
estado_civil  11162      3     married  6351
educacao      11162      4   secondary  5476
possui_casa   11162      2          no  5881
emprestimo    11162      2          no  9702
mes           11162     12         may  2824
deposito      11162      2          no  5873

In [34]:
df

,idade,emprego,estado_civil,educacao,saldo_bancario,possui_casa,emprestimo,dia,mes,duracao,qtd_contato,deposito
0,59,admin.,married,secondary,2343,yes,no,5,may,1042,1,yes
1,56,admin.,married,secondary,45,no,no,5,may,1467,1,yes
2,41,technician,married,secondary,1270,yes,no,5,may,1389,1,yes
3,55,services,married,secondary,2476,yes,no,5,may,579,1,yes
4,54,admin.,married,tertiary,184,no,no,5,may,673,2,yes
...,...,...,...,...,...,...,...,...,...,...,...,...
11157,33,blue-collar,single,primary,1,yes,no,20,apr,257,1,no
11158,39,services,married,secondary,733,no,no,16,jun,83,4,no
11159,32,technician,single,secondary,29,no,no,19,aug,156,2,no
11160,43,technician,married,secondary,0,no,yes,8,may,9,2,no
11161,34,technician,married,secondary,0,no,no,9,jul,628,1,no

### 2.7 - Verificar valores núlos

O comando ``.isna()`` retorna a tabela com True onde for valor nulo e False para os valores que não são nulos.

In [37]:
df.isna()

,idade,emprego,estado_civil,educacao,saldo_bancario,possui_casa,emprestimo,dia,mes,duracao,qtd_contato,deposito
0,True,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
11157,False,False,False,False,False,False,False,False,False,False,False,False
11158,False,False,False,False,False,False,False,False,False,False,False,False
11159,False,False,False,False,False,False,False,False,False,False,False,False
11160,False,False,False,False,False,False,False,False,False,False,False,False
11161,False,False,False,False,False,False,False,False,False,False,False,False

Repare que desta forma não é tão útil usar este comando. Entretando, podemos usar junto o comando ``.sum()`` para retornar quantos valores núlos existem em cada coluna

In [38]:
df.isna().sum()

idade             1
emprego           0
estado_civil      0
educacao          0
saldo_bancario    0
possui_casa       0
emprestimo        0
dia               0
mes               0
duracao           0
qtd_contato       0
deposito          0
dtype: int64

Neste caso, não temos nem um valor nulo nas colunas, mas imagine que tivese alguma coluna com 10 valores núlos...Se a base de dados possuir 100 registros (linhas), a coluna com 10 valores núlos teria 10% de valores núlos e, se a base tivesse 100000 linhas, esta coluna teria apenas 0.01% de valores núlos.

Então uma análise que faz muito mais sentido, é verificar a porcentagem de valores núlos por coluna, para isto, podemos fazer uma regra de 3 com quantidade de valores núlos * 100 / quantidade total de linhas

In [39]:
df.isna().sum() * 100 / len(df)

idade             0.008959
emprego           0.000000
estado_civil      0.000000
educacao          0.000000
saldo_bancario    0.000000
possui_casa       0.000000
emprestimo        0.000000
dia               0.000000
mes               0.000000
duracao           0.000000
qtd_contato       0.000000
deposito          0.000000
dtype: float64

Neste caso, a porcentagem é zero, mas se der algum número com múitas casas decimais, podemos usar a função round() para arredondar para quantas casas decimais desejarmos

In [44]:
# Arredonda  a porcentagem de valores núlos para 2 casas decimais
round(df.isna().sum() * 100 / len(df), 4)

idade             0.009
emprego           0.000
estado_civil      0.000
educacao          0.000
saldo_bancario    0.000
possui_casa       0.000
emprestimo        0.000
dia               0.000
mes               0.000
duracao           0.000
qtd_contato       0.000
deposito          0.000
dtype: float64